podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FGPIOA_MKL82Z7.svd.xml
<!--
Devices using this peripheral: 
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "FGPIOA_MKL82Z7" ?>
         <name>FGPIOA</name>
         <description>General Purpose Input/Output</description>
         <groupName>FGPIO</groupName>
         <prependToName>FGPIOA_</prependToName>
         <headerStructName>FGPIO</headerStructName>
         <baseAddress>0xF8000000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x4</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x10</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PDOR</name>
               <description>Port Data Output Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>PDO</name>
                     <description>Port Data Output</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSOR</name>
               <description>Port Set Output Register</description>
               <addressOffset>0x4</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PTSO</name>
                     <description>Port Set Output</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Corresponding bit in PDORn does not change</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Corresponding bit in PDORn is set to logic 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCOR</name>
               <description>Port Clear Output Register</description>
               <addressOffset>0x8</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PTCO</name>
                     <description>Port Clear Output</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Corresponding bit in PDORn does not change</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Corresponding bit in PDORn is cleared to logic 0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTOR</name>
               <description>Port Toggle Output Register</description>
               <addressOffset>0xC</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PTTO</name>
                     <description>Port Toggle Output</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Corresponding bit in PDORn does not change</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Corresponding bit in PDORn is set to the inverse of its existing logic state</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDIR</name>
               <description>Port Data Input Register</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PDI</name>
                     <description>Port Data Input</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Pin logic level is logic 0, or is not configured for use by digital function</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Pin logic level is logic 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDDR</name>
               <description>Port Data Direction Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>PDD</name>
                     <description>Port Data Direction</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Pin is configured as general-purpose input, for the GPIO function</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Pin is configured as general-purpose output, for the GPIO function</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
